function q(group, qtype, arg1=null, arg2=null) {
    return {
        "type": qtype,
        "arg1": arg1,
        "arg2": arg2,
        "group": group
    }
}

function makeid(length) {
    var result           = '';
    var characters       = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789';
    var charactersLength = characters.length;
    for ( var i = 0; i < length; i++ ) {
        result += characters.charAt(Math.floor(Math.random() * charactersLength));
    }
    return result;
}

function createArangeOptions(index) {
    window.localStorage.setItem("storeArangeOptions" + index, "1")
    const q_arange = document.getElementById("q_arange_options");
    while(q_arange.hasChildNodes()) q_arange.removeChild(q_arange.firstChild)
    const option = document.querySelector(".arange-option");
    console.log(option)
    for(const j in arangeOptions[index]) {
        const o = arangeOptions[index][j]
        const elem = option.cloneNode(true)
        elem.id = `ao${j}` //makeid(5);
        elem.innerText = o;
        elem.style.display = "block";
        q_arange.appendChild(elem);
        const i = $(`#${elem.id}`)
        i.draggable({revert: true, revertDuration: 0, axis: 'y', snap: 'inner'});
        i.droppable({drop: function (event, ui)
            {
                var one = $(this).text();
                var two = ui.draggable.text();
                let oneI = parseInt($(this).attr('id').slice(2))
                let twoI = parseInt(ui.draggable.attr('id').slice(2))
                $(this).text(two);
                ui.draggable.text(one);
                let tmp = arangeOptions[index][oneI];
                arangeOptions[index][oneI] = arangeOptions[index][twoI];
                arangeOptions[index][twoI] = tmp;
                console.log(arangeOptions)
                window.localStorage.setItem("arangeOptions", JSON.stringify(arangeOptions))

            }})
    }
}

const questions = [
    q("", "intro"),
    q("", "sex"),
    q("", "methodic",
    "МЕТОДИКА ДІАГНОСТИКИ СОЦІАЛЬНО-ПСИХОЛОГІЧНИХ УСТАНОВОК ОСОБИСТОСТІ МОТИВАЦІЙНО-ПОТРЕБОВОЇ СФЕРІ О.Ф.ПОТЬОМКІНОЇ",
        "Прочитавши запитання, дайте на них відповіді «так» чи «ні»."
        ),

    // Шкала А
    q("Потьомкіна Шкала А", "yesno", "Вам часто кажуть, що ви більше думаєте про інших, ніж про себе?"),
    q("Потьомкіна Шкала А", "yesno", "Вам легше просити за інших, ніж за себе?"),
    q("Потьомкіна Шкала А", "yesno", "Вам важко відмовити людям, коли вони про щось просять?"),
    q("Потьомкіна Шкала А", "yesno", "Ви часто намагаєтеся допомогти людям, якщо у них трапилися неприємності і біда?"),
    q("Потьомкіна Шкала А", "yesno", "Для себе ви робите щось з більшим задоволенням, ніж для інших?"),
    q("Потьомкіна Шкала А", "yesno", "Ви намагаєтеся зробити якомога більше для інших людей?"),
    q("Потьомкіна Шкала А", "yesno", "Ви переконані, що найбільша цінність — жити для інших людей?"),
    q("Потьомкіна Шкала А", "yesno", "Вам важко примусити себе щось зробити для інших?"),
    q("Потьомкіна Шкала А", "yesno", "Ваша характерна риса — безкорисливість?"),
    q("Потьомкіна Шкала А", "yesno", "Ви переконані, що турбота про інших часто шкодить вам?"),
    q("Потьомкіна Шкала А", "yesno", "Ви засуджуєте людей, котрі не вміють потурбувати ся про себе?"),
    q("Потьомкіна Шкала А", "yesno", "Ви часто просите людей зробити щось із корисливих спонук?"),
    q("Потьомкіна Шкала А", "yesno", "Ваша характерна риса — намагання допомогти іншим людям?"),
    q("Потьомкіна Шкала А", "yesno", "Ви вважаєте, що спочатку людина повинна думати про себе, а потім уже про інших?"),
    q("Потьомкіна Шкала А", "yesno", "Ви багато часу приділяєте своїй персоні?"),
    q("Потьомкіна Шкала А", "yesno", "Ви переконані, що не потрібно для інших сильно напружуватися?"),
    q("Потьомкіна Шкала А", "yesno", "Для себе у вас не вистачає ні сил, ні часу?"),
    q("Потьомкіна Шкала А", "yesno", "Вільний час ви використовуєте лише для своїх захоплень?"),
    q("Потьомкіна Шкала А", "yesno", "Ви можете назвати себе егоїстом?"),
    q("Потьомкіна Шкала А", "yesno", "Ви здатні зробити максимальні зусилля лише за високу винагороду?"),

    // Шкала Б
    q("Потьомкіна Шкала Б", "yesno", "Процес виконуваної роботи захоплює вас більше, ніж її завершення?"),
    q("Потьомкіна Шкала Б", "yesno", "Для досягнення мети ви не шкодуєте сил?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви довго не відважуєтеся розпочати робити те, що вам нецікаво, навіть якщо це необхідно?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви впевнені, що у вас вистачить наполегливості для завершення будь-якої справи?"),
    q("Потьомкіна Шкала Б", "yesno", "Закінчуючи цікаву справу, ви шкодуєте, що вона вже завершена?"),
    q("Потьомкіна Шкала Б", "yesno", "Вам більше до вподоби люди, здатні досягати результату, ніж ті, головною характеристикою яких є доброта і чуйність?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви отримуєте задоволення від гри, в якій не важливий результат?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви вважаєте, що успіхів у вашому житті більше, ніж невдач?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви більше поважаєте людей, здатних захопитися справою по-справжньому?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви часто завершуєте роботу, якщо не вистачає часу, склалася неприємна ситуація, існують зовнішні перешкоди?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви часто починаєте одночасно багато справ і не встигаєте їх закінчити?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви вважаєте, що маєте достатньо сил, щоб розраховувати на успіх у житті?"),
    q("Потьомкіна Шкала Б", "yesno", "Чи можете ви захопитися справою настільки, що забуваєте про себе та час?"),
    q("Потьомкіна Шкала Б", "yesno", "Вам часто вдається довести розпочату справу до кінця?"),
    q("Потьомкіна Шкала Б", "yesno", "Чи буває, що, захоплюючись справами, ви не можете закінчити розпочате?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви уникаєте зустрічей із людьми, які не наділені діловими якостями?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви часто навантажуєте свої вихідні дні чи відпустку роботою, усвідомлюючи потребу щось зробити?"),
    q("Потьомкіна Шкала Б", "yesno", "Ви вважаєте, що головне у будь-якій справі результат?"),
    q("Потьомкіна Шкала Б", "yesno", "Погоджуючись на справу, ви думаєте про те, наскільки вона для вас є цікавою?"),
    q("Потьомкіна Шкала Б", "yesno", "Прагнення до результату в будь-якій справі — риса, що вас вирізняє з-поміж інших?"),

    q("", "methodic", "МЕТОДИКА «ЦІННІСНІ ОРІЄНТАЦІЇ» РОКИЧА",
        "МЕТОДИКА «ЦІННІСНІ ОРІЄНТАЦІЇ» РОКИЧА\n" +
        "Інструкція: Зараз перед Вами речення з певними цінностями. Ваше завдання - розкласти (перетягнути) їх по порядку значимості для Вас як принципів, якими Ви керуєтеся у Вашому житті. \n" +
        "Під цифрою 1 буде найбільш вижлива цінність, а найменш важлива залишиться останньою і буде позначена цифрою 18. \n" +
        "Виконайте не поспішаючи, вдумливо. Кінцевий результат повинен відбивати Вашу справжню позицію\"."),
    q("Рокич", "arange", 1),
    q("Рокич", "arange", 2),

    q("", "methodic", "ОПИТУВАЛЬНИК “ЖИТТЄВІ ЗАВДАННЯ ОСОБИСТОСТІ” (РОЗРОБКА КОЛЕКТИВУ ЛАБОРАТОРІЇ СОЦІАЛЬНОЇ ПСИХОЛОГІЇ ОСОБИСТОСТІ ІСПП НАПН УКРАЇНИ ПІД КЕРІВНИЦТВОМ Т. М. ТИТАРЕНКО)",
        {"male": "Прочитавши запитання, дайте на них відповіді «згоден» чи «не згоден».. Навіть якщо Ви не можете погодитися із жодною відповіддю, все ж оберіть варіант, який більше для Вас прийнятний. \n",
              "female": "Прочитавши запитання, дайте на них відповіді «згодна» чи «не згодна».. Навіть якщо Ви не можете погодитися із жодною відповіддю, все ж оберіть варіант, який більше для Вас прийнятний. \n"}),
    q("Опитувальник Титаренко", "agree", "У наш час роботу треба обирати радше за зарплатнею, ніж за уподобаннями"),
    q("Опитувальник Титаренко", "agree", "Мені дуже б хотілося стати відомою людиною в цьому житті"),
    q("Опитувальник Титаренко", "agree", "Я хочу багато чого змінити в собі"),
    q("Опитувальник Титаренко", "agree", {"male": "Я б хотів у майбутньому займатися улюбленою справою, але важливіше заробляти гроші",
                            "female": "Я б хотіла у майбутньому займатися улюбленою справою, але важливіше заробляти гроші"}),
    q("Опитувальник Титаренко", "agree", "Найактуальніше для мене сьогодні – створення сім’ї"),
    q("Опитувальник Титаренко", "agree", "Я завжди чітко планую майбутнє"),
    q("Опитувальник Титаренко", "agree", "Я більше живу сьогоднішнім днем, ніж майбутнім"),
    q("Опитувальник Титаренко", "agree", "Я завжди дивлюся у майбутнє з оптимізмом, і тому мені не складно ставити нові життєві завдання"),
    q("Опитувальник Титаренко", "agree", "Частіше я керую життєвими обставинами, а не вони мною"),
    q("Опитувальник Титаренко", "agree", "Коли я ставлю перед собою завдання, мені ще невідомі шляхи його розв’язання"),
    q("Опитувальник Титаренко", "agree", {"male": "Коли виникають перешкоди, я впевнений, що впораюся з проблемою",
                            "female": "Коли виникають перешкоди, я впевнена, що впораюся з проблемою"}),
    q("Опитувальник Титаренко", "agree", {"male": "Завдання, які я ставлю, зазвичай виключають одне, я змушений вибирати",
                           "female": "Завдання, які я ставлю, зазвичай виключають одне, я змушена вибирати"}),
    q("Опитувальник Титаренко", "agree", "Обставини мого життя суттєво вплинули на те, які життєві завдання я ставлю перед собою"),
    q("Опитувальник Титаренко", "agree", "У разі зміни зовнішньої ситуації я не змінюю своїх завдань"),
    q("Опитувальник Титаренко", "agree", "При постановці завдань я відчуваю, що можу гори звернути"),
    q("Опитувальник Титаренко", "agree", "Буває, що я порушую встановлені правила"),
    q("Опитувальник Титаренко", "agree", "Комфорт і безтурботність – у майбутньому мені більше нічого не треба"),
    q("Опитувальник Титаренко", "agree", "Усі, урешті-решт, прагнуть влади"),
    q("Опитувальник Титаренко", "agree", "Найголовніше життєве завдання людини – стати професіоналом у своїй справі"),
    q("Опитувальник Титаренко", "agree", {"male": "Оскільки я не можу всіх зробити щасливими, я повинен подбати про себе",
                            "female": "Оскільки я не можу всіх зробити щасливими, я повинна подбати про себе"}),
    q("Опитувальник Титаренко", "agree", "Думаю, що головне моє завдання – учитися"),
    q("Опитувальник Титаренко", "agree", "Я більше довіряю плину подій, щасливому збігу обставин, ніж своїм намірам"),
    q("Опитувальник Титаренко", "agree", "Можна не планувати життя далі ніж на рік уперед"),
    q("Опитувальник Титаренко", "agree", "Думаючи про майбутнє, я часто уявляю всілякі неприємності"),
    q("Опитувальник Титаренко", "agree", "Того, що я бачу як своє життєве завдання, я досягну власними силами"),
    q("Опитувальник Титаренко", "agree", "Я завжди уявляю в подробицях, як буду рухатися до бажаного результату"),
    q("Опитувальник Титаренко", "agree", "Переді мною постає стільки життєвих труднощів, що подолати їх усі просто неможливо"),
    q("Опитувальник Титаренко", "agree", "Іноді мої життєві завдання суперечать одне одному, і я не можу здійснити все"),
    q("Опитувальник Титаренко", "agree", "Не думаю, що життєві завдання визначаються обставинами мого життя"),
    q("Опитувальник Титаренко", "agree", "Я легко переключаюся з одного життєвого завдання на інше"),
    q("Опитувальник Титаренко", "agree", "Нові завдання мене більше бентежать, аніж мобілізують"),
    q("Опитувальник Титаренко", "agree", "Я завжди дотримуюся своїх обіцянок"),
    q("Опитувальник Титаренко", "agree", "Головне для мене в майбутньому – це матеріальна забезпеченість"),
    q("Опитувальник Титаренко", "agree", "Досягненням є те, що визнають інші"),
    q("Опитувальник Титаренко", "agree", "Єдине справжнє життєве завдання – це пошук себе, самовдосконалення"),
    q("Опитувальник Титаренко", "agree", "Мені подобається допомагати іншим, коли це не заважає кар’єрі"),
    q("Опитувальник Титаренко", "agree", "Життєвий успіх неможливий без доброго здоров’я"),
    q("Опитувальник Титаренко", "agree", "Час життя обмежений, але мені вдається використовувати його оптимально"),
    q("Опитувальник Титаренко", "agree", "Найголовніше у моєму житті відбуватиметься протягом найближчих п’яти років"),
    q("Опитувальник Титаренко", "agree", "Мене лякають усілякі несподіванки, що чекають у майбутньому"),
    q("Опитувальник Титаренко", "agree", "Приймаючи життєве рішення, я більше орієнтуюся на “так треба”, “так прийнято”, аніж на “я хочу цього”, “це мені потрібно”"),
    q("Опитувальник Титаренко", "agree", "Я часто не можу вирішувати свої життєві завдання – не маю часу, грошей, інформації, допомоги"),
    q("Опитувальник Титаренко", "agree", "Якщо в моєму житті не вистачає складностей, я їх шукаю"),
    q("Опитувальник Титаренко", "agree", "Усі мої життєві завдання я легко можу розташувати за важливістю"),
    q("Опитувальник Титаренко", "agree", "Мені неважко проаналізувати причини та наслідки своїх життєвих завдань"),
    q("Опитувальник Титаренко", "agree", {"male": "Я намагаюся досягти того, що запланував, навіть усупереч обставинам",
                            "female": "Я намагаюся досягти того, що запланувала, навіть усупереч обставинам"}),
    q("Опитувальник Титаренко", "agree", {"male": "Мені неважко тривалий час бути включеним в активну діяльність",
                            "female": "Мені неважко тривалий час бути включеною в активну діяльність"}),
    q("Опитувальник Титаренко", "agree", "Я ніколи не відкладаю на завтра те, що можна зробити сьогодні"),
    q("Опитувальник Титаренко", "agree", "Усі хочуть мати престижні речі"),
    q("Опитувальник Титаренко", "agree", "У житті мало речей, важливіших за успіх"),
    q("Опитувальник Титаренко", "agree", "Я думаю, що впливати на власний розвиток дуже важко"),
    q("Опитувальник Титаренко", "agree", "Покращити світ навіть у чомусь незначному – моє життєве завдання"),
    q("Опитувальник Титаренко", "agree", "Молода людина може поки що не замислюватися серйозно про своє здоров’я"),
    q("Опитувальник Титаренко", "agree", "Життя таке непередбачуване, що не варто його планувати"),
    q("Опитувальник Титаренко", "agree", "У віці моїх батьків я досягну справжнього успіху"),
    q("Опитувальник Титаренко", "agree", "Не варто очікувати від майбутнього чогось особливо хорошого"),
    q("Опитувальник Титаренко", "agree", "У своєму житті я дотримуюся принципів, заснованих на почутті обов’язку"),
    q("Опитувальник Титаренко", "agree", "Ставлячи перед собою важливе життєве завдання, я знаю, чого хочу досягти в кінцевому підсумку"),
    q("Опитувальник Титаренко", "agree", "У мене не такий сильний характер, щоб проявляти стійкість у складних обставинах"),
    q("Опитувальник Титаренко", "agree", "Я завжди чітко знаю, що для мене головне в житті"),
    q("Опитувальник Титаренко", "agree", "Часто я не враховую далекі наслідки тих життєвих завдань, які ставлю перед собою тепер"),
    q("Опитувальник Титаренко", "agree", "Якщо не буде виходити так, як задумано спочатку, я робитиму це іншим чином"),
    q("Опитувальник Титаренко", "agree", "Я більше люблю спокійний відпочинок, ніж бурхливі розваги"),
    q("Опитувальник Титаренко", "agree", "Непристойні жарти викликають у мене сміх"),
    q("Опитувальник Титаренко", "agree", "Для щастя необхідні гроші"),
    q("Опитувальник Титаренко", "agree", "Між престижною і цікавою роботою я радше оберу престижну"),
    q("Опитувальник Титаренко", "agree", "Життєві труднощі радше перешкоджають моєму розвитку, ніж допомагають"),
    q("Опитувальник Титаренко", "agree", "Більшість завдань у житті вимагають насамперед сумлінної праці, а не творчості"),
    q("Опитувальник Титаренко", "agree", "Спочатку треба стати на ноги, а вже потім думати про все інше"),
    q("Опитувальник Титаренко", "agree", {"male": "Я нерідко сам не знаю, чого хочу і яким чином слід діяти в різних життєвих обставинах",
                            "female": "Я нерідко сама не знаю, чого хочу і яким чином слід діяти в різних життєвих обставинах"}),
    q("Опитувальник Титаренко", "agree", "У мене є завдання, розраховані на все життя"),
    q("Опитувальник Титаренко", "agree", "Я вірю в себе, і тому майбутнє мене не страшить"),
    q("Опитувальник Титаренко", "agree", "Мої життєві успіхи більше залежать від вдалого збігу обставин, ніж від моїх здібностей і зусиль"),
    q("Опитувальник Титаренко", "agree", "Без усебічного аналізу обставин я, як правило, не ставлю важливі для мого майбутнього завдання"),
    q("Опитувальник Титаренко", "agree", "Несподівані зміни на тривалий час вибивають мене з колії"),
    q("Опитувальник Титаренко", "agree", "Мені важко зрозуміти, які життєві завдання для мене важливіші: чи навчання, чи робота, чи дружба, чи сім’я"),
    q("Опитувальник Титаренко", "agree", "Для вирішення життєвого завдання не обов’язково враховувати попередній досвід"),
    q("Опитувальник Титаренко", "agree", "Мені подобається, коли, крім завдання, я отримую план його розв’язання"),
    q("Опитувальник Титаренко", "agree", "На жаль, у мене недостатньо сил та енергії для втілення в життя намічених завдань"),
    q("Опитувальник Титаренко", "agree", "Якщо я не правий, то ніколи не серджуся"),
    q("Опитувальник Титаренко", "agree", "Без друзів я не досягну успіху в житті"),
    q("Опитувальник Титаренко", "agree", "Я планую своє майбутнє до дрібниць, крок за кроком"),
    q("Опитувальник Титаренко", "agree", "У грі я люблю бути переможцем"),
    q("Опитувальник Титаренко", "agree", "Сім’я і діти – це поки що не для мене"),
    q("Опитувальник Титаренко", "agree", "Я зазвичай ставлю перед собою конкретні завдання та намічаю реальні строки їх виконання"),
    q("Опитувальник Титаренко", "agree", "Буває, чиясь необачність викликає у мене сміх"),
    q("Опитувальник Титаренко", "agree", "На першому місці завжди мають бути друзі"),

    q("", "methodic", "АНКЕТА «МОТИВИ ВОЛОНТЕРСЬКОЇ ДІЯЛЬНОСТІ»",
        "Вам потрібно обрати варіанти або написати відповідь, яка найточніше описує Вашу думку"),
    q("Анкета", "input", "Чому Ви почали займатися волонтерською діяльністю?"),
    q("Анкета", "input", "Ваш досвід волонтерської діяльності"),
    q("Анкета", "input", "Опишіть Ваші основні функції як волонтера?"),
    q("Анкета", "choiceWithCustom", "Мені подобається волонтерська діяльність як змога знайти: ",
        ["Друзів", "Кохану людину", "Однодумців"]),
    q("Анкета", "choice", "Скільки Ви витрачаєте часу на волонтерську діяльність? (кількість годин на тиждень): ",
        ["менше ніж 5 годин", "5-10 годин", "понад 11 годин"]),
    q("Анкета", "input", "Скільки часу Ви ще плануєте займатися волонтерською діяльністю?"),
    q("Анкета", "yesno", "Чи схвалюють Вашу волонтерську діяльність сім'я та близькі люди?"),
    q("Анкета", "yesno", "Чи є серед вашого оточення учасники бойових дій?"),
    q("Анкета", "choice", "Оцініть за шкалою від 0 до 5, наскільки сильно ви відчуваєте підтримку вашої діяльності оточуючими сьогодні?<br>" +
        "0. перешкоджають мені у реалізації цього прагнення<br>" +
        "1. трохи перешкоджають мені у реалізації цього прагнення<br>" +
        "2. не підтримують мене і не перешкоджають мені у реалізації цього прагнення<br>" +
        "3. трохи підтримують мене у реалізації цього прагнення<br>" +
        "4. підтримують мене у реалізації цього прагнення<br>" +
        "5. повністю підтримують мене у реалізації цього прагнення",
        ["0",
              "1",
              "2",
              "3",
              "4",
              "5"]),
    q("Анкета", "choice", "Що, на вашу думку, є основним мотивом для здійснення добровільної діяльності?",
        ["Бажання заявити про себе", "Потреба допомагати людям", "Значимість і престиж", "Достатня кількість вільного часу"]),
    q("Анкета", "methodic", "", "Оцініть кожен із запропонованих мотивів за шкалою від 0 до 5. Залежно від того, наскільки він для Вас важливий у Вашій діяльності?"),
    q("Анкета", "choice", "Хочу приносити користь",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Хочу відплатити людям добром за добро",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Для власного задоволення",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Хочу вирішити проблему, що хвилює мене особисто",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Хочу отримати новий досвід чи знання",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Хочу мати якесь заняття",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Хочу познайомитися з новими людьми",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Хочу підвищити свою самооцінку",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Хочу самореалізуватися",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Хочу отримати повагу та визнання оточуючих",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Не можу дивитися байдуже на страждання інших",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),
    q("Анкета", "choice", "Тому що друзі (знайомі, родичі) беруть участь",
        ["зовсім не важливо", "майже не важливо", "відносно важливо", "безперечно важливо", "дуже важливо"]),

    q("Анкета", "yesno", "Чи Ви є вимушено переміщеною особою?"),
    q("Анкета", "input", "Ваша спеціальність/професія?"),
    q("Анкета", "input", "Ваш вік"),

    q("", "outro")
]


const defaultArangeOptions = [
    [
        "активна діяльна життя (повнота та емоційна насиченість життя);",
        "життєва мудрість (зрілість суджень і здоровий глузд, що досягаються життєвим досвідом);",
        "здоров'я (фізичне і психічне);",
        "цікава робота;",
        "краса природи і мистецтва (переживання прекрасного в природі і в мистецтві);",
        "любов (духовна і фізична близькість з коханою людиною);",
        "матеріально забезпечене життя (відсутність матеріальних труднощів);",
        "наявність хороших і вірних друзів;",
        "суспільне покликання (повага оточуючих, колективу, товаришів по роботі);",
        "пізнання (можливість розширення своєї освіти, кругозору, загальної культури, інтелектуальне розвиток);",
        "продуктивна життя (максимально повне використання своїх можливостей, сил і здібностей);",
        "розвиток (робота над собою, постійне фізичне і духовне вдосконалення);",
        "розваги (приємне, необтяжливе проведення часу, відсутність обов'язків)",
        "свобода (самостійність, незалежність у судженнях і вчинках)",
        "щасливе сімейне життя",
        "щастя інших (добробут, розвиток і вдосконалення інших людей, всього народу, людства в цілому)",
        "творчість (можливість творчої діяльності)",
        "впевненість у собі (внутрішня гармонія, свобода від внутрішніх протиріч; сумнівів)."
    ],
    [
        "акуратність (охайність), вміння тримати в порядку речі, порядок у справах;",
        "вихованість (гарні манери);",
        "високі запити (високі вимоги до життя і високі домагання);",
        "життєрадісність (почуття гумору);",
        "старанність (дисциплінованість);",
        "незалежність (здатність діяти самостійно, рішуче);",
        "непримиренність до недоліків у собі та інших;",
        "освіченість (широта знань, висока загальна культура);",
        "відповідальність (почуття боргу, уміння тримати своє слово);",
        "раціоналізм (вміння тверезо і логічно мислити, приймати обдумані, раціональні рішення);",
        "самоконтроль (стриманість, самодисципліна);",
        "сміливість у відстоєнні своєї думки, поглядів;",
        "тверда воля (вміння настояти на своєму, не відступати перед труднощами)",
        "терпимість (до поглядів і думок інших, вміння прощати іншим їхні помилки та омани)",
        "широта поглядів (уміння зрозуміти чужу точку зору, поважати інші смаки, звичаї, звички)",
        "чесність (правдивість, щирість)",
        "ефективність у справах (працьовитість, продуктивність у роботі)",
        "чуйність (дбайливість)"
    ]
]
let arangeOptions = defaultArangeOptions;
var storedOptions = window.localStorage.getItem("arangeOptions")
if(storedOptions) {
    arangeOptions = JSON.parse(storedOptions);
}

// setTimeout(createArangeOptions, 2)